tutorials/twoLiquidMixingFoam/twoStream/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices        
(
    (0  -1   0)
    (10 -1   0)
    (0   0   0)
    (10  0   0)
    (0   1   0)
    (10  1   0)

    (0  -1   1)
    (10 -1   1)
    (0   0   1)
    (10  0   1)
    (0   1   1)
    (10  1   1)
);

blocks          
(
    hex (0 1 3 2 6 7 9 8) (100 20 1) simpleGrading (1 0.2 1)
    hex (2 3 5 4 8 9 11 10) (100 20 1) simpleGrading (1 5 1)
);

edges           
(
);

patches         
(
    patch bottomInlet
    (
        (0 6 8 2)
    )
    patch topInlet
    (
        (2 8 10 4)
    )
    patch outlet
    (
        (1 3 9 7)
        (3 5 11 9)
    )
    wall pipe
    (
        (0 1 7 6)
        (4 10 11 5)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
