tutorials/twoLiquidMixingFoam/twoStream/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/hjasak/OpenFOAM/OpenFOAM-1.3/tutorials/twoLiquidMixingFoam";
    case "twoStream";
    instance ""constant"";
    local "polyMesh";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
bottomInlet
{
    type patch;
    nFaces 20;
    startFace 7860;
}

topInlet
{
    type patch;
    nFaces 20;
    startFace 7880;
}

outlet
{
    type patch;
    nFaces 40;
    startFace 7900;
}

pipe
{
    type wall;
    nFaces 200;
    startFace 7940;
}

defaultFaces
{
    type empty;
    nFaces 8000;
    startFace 8140;
}
)

// ************************************************************************* //
