tutorials/twoLiquidMixingFoam/twoStream/0/pd
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          pd;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottomInlet
    {
        type            zeroGradient;
    }
    topInlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedMeanValue;
        meanValue       0;
        value           uniform 0;
    }
    pipe
    {
        type            zeroGradient;
    }
    defaultFaces    
    {
        type            empty;
    }
}


// ************************************************************************* //
